{"source": "news", "id": "https://dailyhodl.com/2025/04/19/trader-michael-van-de-poppe-says-bitcoin-to-rally-to-new-all-time-high-once-theres-clarity-on-these-two-matters/", "title": "Trader Michaël van de Poppe Says Bitcoin To Rally to New All-Time High Once There’s Clarity on These Two Matters", "published": "2025-04-19", "text": "A widely followed crypto analyst believes that Bitcoin (BTC) will print new all-time highs once there’s more clarity around two key issues.\n\nIn a new thread, crypto trader Michaël van de Poppe tells his 783,300 followers on the social media platform X that Bitcoin will likely break out once US President Donald Trump’s tariff policies and the Fed’s rate cut plans are clearer.\n\n“Bitcoin is still stuck in a range, which it has been acting in for basically two months. The longer something stays within a narrow range, the heavier the impulse will be once it breaks out of it. I assume that we’ll see light at the end of the tunnel with the FED/tariffs and that Bitcoin will fast rally towards new all-time highs in this quarter.”\n\nThe analyst also predicts that Bitcoin will outperform gold over the next year.\n\n“Quite frankly, if you’d ask me to choose between BTC or gold for the next 12 months, I’d almost always take Bitcoin as I assume that will be, percent-wise, substantially higher than gold. If you put it wider, if I had another $1,000 available, I’d rather want to put it in ETH.”\n\nThe analyst says that Bitcoin’s bull run will likely catch many off guard as worries about a recession mount.\n\n“It’s the final shakeout where a big majority believes we’re in a recession and early-peak top for Bitcoin. And then the big run comes.”\n\nBitcoin is trading for $84,576 at time of writing, flat on the day.\n\nFollow us on X Facebook and Telegram\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney", "status": "success"}
{"source": "news", "id": "https://coinfomania.com/pantera-ceo-counters-michael-saylors-13-million-bitcoin-prediction-with-realistic-745k-target/", "title": "Pantera CEO Counters Michael Saylor’s $13 Million Bitcoin Prediction With “Realistic” $745K Target", "published": "2025-04-19", "text": "The debate about the Bitcoin price’s future is heating up in the cryptocurrency market. Adding their own two cents to the debate, two of the crypto industry’s most prominent figures have offered contrasting predictions. MicroStrategy co-founder Michael Saylor has assumed a bullish stance. He has predicted that Bitcoin could soar to a whopping $13 million per piece in the next twenty years. On the other hand, Pantera Capital CEO Dan Morehead has provided a more tempered forecast, claiming that the Bitcoin price could reach a “realistic” $745,000 by 2028.\n\nSaylor’s $13 Million Bitcoin Prediction: The Ultimate Store of Value\n\nMichael Saylor, known to be the biggest Bitcoin maximalist, recently reiterated his prediction. At the Digital Asset Summit, he claimed that Bitcoin’s fixed supply of 21 million coins makes it a scarce commodity, unlike gold and oil. He believes gold and oil can be produced if demand surges. “I can stand here and say, I think Bitcoin’s gonna be $13 million in 20 years,” Saylor declared.\n\nPantera CEO Morehead Counters with $745K, Citing Institutional Adoption\n\nDan Morehead offers a more grounded perspective, though still bullish. In a November 2024 CNBC interview, he predicted Bitcoin could reach $745,000 by 2028, calling the cryptocurrency “officially at escape velocity.” Morehead dismissed his previous cautious stance that Bitcoin could go to zero, stating, “I don’t think it’s possible. Now, 50 million people in the US own and 300 million people globally, BlackRock and Fidelity are selling it like it.”\n\nPantera Capital CEO predicts #Bitcoin could reach $745,000, citing mass adoption, institutional support, and a potential $15T market cap. pic.twitter.com/4Iv8rLnwpN — Roundtable Network (@RTB_io) April 18, 2025\n\nMorehead highlighted the growing institutional embrace of Bitcoin, with major asset managers offering it to clients, and pointed out that a $745,000 price would push Bitcoin’s market cap to about $15 trillion, a fraction of the roughly $500 trillion in global financial assets. “That still seems small,” he said, referencing Saylor’s even loftier target.\n\nWhile Saylor’s $13 million price tag captures imaginations, Morehead’s forecast reflects a more measured optimism grounded in current adoption trends and market realities. Both agree, however, that Bitcoin’s future is bright and that betting on it going to zero is no longer a sensible position. With these bullish predictions coming in, let’s take a look at the latest price action to form a short-term Bitcoin prediction.\n\nBitcoin Price Analysis\n\nBitcoin commenced trading at a price of $84,880 yesterday. In the initial hours, Bitcoin faced a downtrend, but then ascended rapidly to test the $85,100 resistance. However, it could not sustain the bullish trend, and a slow decline followed. This downturn led Bitcoin to establish a new support at $84,450. With the $84,750 resistance in place, Bitcoin went on to display range-bound behavior until 12:00 UTC. But Bitcoin failed to form any meaningful uptrend from that point. At 13:00 UTC, a death cross formed on the MACD, leading Bitcoin to abandon the support level.\n\nChart 1: published on TradingView, April 19, 2025\n\nIt eventually settled at a new support level of $84,350. Bitcoin continued to work in a trading range, with the $84,750 resistance still in place. However, Bitcoin’s upward movements found resistance at the $84,650 mark, as it continues to consolidate in that narrow range. At 00:30 on April 19, a golden cross formed on the MACD, and Bitcoin started scaling the charts. The resistance was broken at 3:00 UTC as Bitcoin continued to ascend to $85,250. With the market now overbought, Bitcoin faced a correction.\n\nBitcoin Price Prediction: Can Bitcoin Hold on Above $85K?\n\nBitcoin currently trades at $85,100. However, based on past performances, Bitcoin may relinquish its current support of $84,900 and look to stabilize under $ 85 K. With the coin in overbought conditions right now, a correction is bound to arrive. If Bitcoin can resist a dramatic fall, we may be in for a shot at $ 86 K. As of now, $745K sounds like a far cry, but given the worldwide interest Bitcoin has garnered, Morehead’s Bitcoin prediction is not too far-fetched either.", "status": "success"}
{"source": "news", "id": "https://coinpedia.org/news/bitcoin-price-prediction-2025/", "title": "Bitcoin Price Prediction 2025", "published": "2025-04-19", "text": "Fun-loving and cheerful, a passionate blockchain and crypto writer who knows no boundary…connect if you share the same passion. With 10+ years of writing experience, I am a Crypto Journalist by chance, exploring, and learning all the dynamics of the sci-fi action-filled crypto world. Currently, focusing on cryptocurrency news and price data. With a passion for research and challenging my capabilities, I am slowly getting into the crypto arena to bring new insights every day.\n\nStory Highlights Bitcoin is holding strong above $84,500, fueled by positive economic news and investor interest.\n\nAnalyst Benjamin Cowen predicts a major Bitcoin rally later this cycle, potentially reaching $120,000-$150,000.\n\nMaintaining support above $72,000 is crucial for Bitcoin's bullish trend to continue.\n\nBitcoin is holding strong above $84,500, showing resilience as market sentiment shifts. Strong U.S. job data and growing expectations of interest rate cuts are pushing investors to move away from traditional stocks and toward Bitcoin. Even as big tech stocks struggle, Bitcoin continues to show strength.\n\nCan BTC Break $84.9K? Bulls Target $87K Next\n\nBitcoin’s short-term outlook looks promising. If the price manages to break above $84,900, analysts say the next key target could be $87,000. So far, buyers are in control, and as long as that holds, the uptrend is expected to continue.\n\nBenjamin Cowen’s Bullish Outlook for Bitcoin\n\nPopular crypto analyst Benjamin Cowen believes that Bitcoin’s biggest move this cycle may still be in the cards. In a bullish scenario, he sees the price potentially hitting $200,000. More realistically, he expects a cycle top between $120,000 and $150,000 — but likely later in the cycle.\n\nAlso Read :\n\nAltcoin Season Coming Soon as BTC Dominance Rejected at Key Level\n\n,\n\n$72K Is Key Support — Can It Hold?\n\nOne of the most important levels to watch is Bitcoin’s 2024 high near $72,000. According to Cowen, holding this level on the weekly chart is essential to keep the bullish trend intact. While BTC hasn’t retested this zone yet, if it does, strong buying interest is expected to step in.\n\nCalm Market, But Bulls Still in the Lead\n\nAt the moment, Bitcoin is trading around $84,483, with little movement in the past 24 hours. Cowen remains cautiously optimistic. He notes that if a pullback happens, it will serve as a key test for the market’s strength. If BTC continues to hold above major levels, it could set the stage for a stronger rally later this year.\n\nCowen’s outlook remains bullish in the long term, with a possible move into six-figure territory. But for that to happen, Bitcoin needs to keep its momentum. For now, the bulls are holding steady — but the real test may still be ahead.\n\nWith key levels holding firm and sentiment shifting, Bitcoin’s next move could set the tone for the rest of the cycle.\n\nNever Miss a Beat in the Crypto World! Stay ahead with breaking news, expert analysis, and real-time updates on the latest trends in Bitcoin, altcoins, DeFi, NFTs, and more.\n\nFAQs", "status": "success"}
{"source": "news", "id": "https://u.today/no-way-xrp-is-worth-5800-vs-bitcoin-samson-mow", "title": "No Way XRP Is Worth $5,800 Vs Bitcoin: Samson Mow", "published": "2025-04-19", "text": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nBitcoiner Samson Mow published a tweet, suggesting that even if top altcoins had a total coin supply similar to that of Bitcoin, BTC would still beat them in terms of price per coin.\n\nMow stated that most altcoins are taking advantage of the so-called unit bias — a psychological effect that appears since, due to their huge supplies of billions and sometimes even trillions of coins, the price per coin seems cheaper than that of one BTC.\n\nIf this bias is removed, he says, then mathematically, these altcoins should be worth several thousand of dollars each. But Mow doesn’t believe in these theoretical figures, saying that Bitcoin would still have a much higher market dominance.\n\nAdvertisement\n\n\"No way XRP is worth $5,800\"\n\nMow suggested that if this bias is removed, XRP would cost $5,800, SOL would be trading at $3,400, and ETH at $9,200. He explained that these figures can be calculated “by taking the market cap of the alts and dividing by 21 million, thus framing their supply in terms of Bitcoin supply.”\n\nFor example, he shows, ETH: $193B market cap / 21M = $9,200. Most altcoins, Mow claims, take advantage of this unit bias “by utilizing a very high supply, so people can't figure out what they're buying.”\n\nMany believe that buying one XRP for $2, for example, is much cheaper than buying Bitcoin at $85,000, he says, adding that “unit bias is absolutely destroying the uninitiated.”\n\nThose numbers are calculated by taking the market cap of the alts and dividing by 21 million, thus framing their supply in terms of Bitcoin supply.\n\n\n\nETH: $193B market cap / 21M = $9,200\n\n\n\nInstead of buying that one twenty-one millionth of Etherium, you could buy just 0.11 BTC. — Samson Mow (@Excellion) April 19, 2025\n\nFinally, he said in reality there is “no way these alts are worth that much.”\n\nNew name for 1-21-millionth unit proposed by Mow\n\nContinuing the topic raised in the above-mentioned tweet, Mow suggested that perhaps one twenty-one millionth unit of any coin needs a name. He stressed that this is not common knowledge, but right now, 10 Sats are called one Finney (after Hal Finney, an early Bitcoin contributor).\n\nJust thinking that we need a better name for one twenty-one millionth.\n\n\n\nWe should use Finney for that. Right now it's uncommon, but a Finney defined as 10 sats - I bet you didn't even know that. No one needs a unit for 10 sats. But we do need an easy to way refer to 1/21… https://t.co/yTMGpXVIbi — Samson Mow (@Excellion) April 19, 2025\n\nBut hardly anybody needs a unit for 10 Sats. Therefore, Mow suggests using this name to define one twenty-one millionth supply unit not only of Bitcoin but of each large altcoin and gold as well. Therefore, he says, “A Finney of Bitcoin = $85,000 (for now). A Finney of ETH = $9,200. A Finney of gold = $1,000,000.” Samson Mow asked the community to share what they think about this idea.", "status": "success"}
{"source": "reddit", "id": "1k2sis7", "title": "Bank of International Settlements report: Cryptocurrencies and decentralised finance: functions and financial stability implications", "text": "Here's the BIS summary blurb:\n\n&gt; Cryptocurrencies and decentralised finance (DeFi) aim to replicate many of the economic functions of traditional finance (TradFi), but their distinctive features introduce new financial stability risks. We analyse these features, and examine key developments, such as smart contracts, decentralised exchanges (DEXs), stablecoins and new forms of central bank money. \n&gt; Our findings suggest that while the underlying economic drivers are not different than in TradFi, DeFi poses significant challenges, including new forms of information asymmetries, market inefficiencies and the risk of cryptoisation in emerging markets. \n&gt; We propose tailored regulatory interventions, such as embedding rules within smart contracts and strengthening the oversight of stablecoins, to manage financial stability risks. Finally, we provide a framework for prudential regulation that can mitigate risks while fostering innovation in the rapidly evolving crypto ecosystem.", "published": "2025-04-19T09:34:37"}
{"source": "reddit", "id": "1k2r5jf", "title": "Bitcoin's security via block rewards has declined more than 50% over the past 4 years [OC]", "text": "Up until recently, Bitcoin's security budget provided by the block rewards has never decreased across a 4-year cycle.\n\nThere's a very clear trend that rate at which block rewards increases from cycle to cycle is greatly decreasing over time.\n\n[Log scale. Anything below 1.0 represents a decline in security over 4 years.](https://preview.redd.it/gyz6g93kyqve1.png?width=857&amp;format=png&amp;auto=webp&amp;s=8943bc3d4dde8d3f79e7b987402639b7ea30cc0d)\n\n* From 2011 to 2015, block rewards increased by \\~500x\n* From 2015 to 2019, block rewards increased by \\~5x\n* From 2019 to 2023, block rewards increased by \\~2x\n* In the most recent year from 2021 to 2025, block rewards increased by \\~0x\n\n2022 was the first time that the block reward decreased in 4 years. And March 2025 was the first time that block rewards decreased by so much that it lost over 50% of its security via block rewards (vs 4 years prior).\n\nEarly Bitcoin devs have always warned that Bitcoin's security is not sustainable unless transaction fees replace the gradually-disappearing block subsidy (or unless Bitcoin adopts a different security model).\n\nHowever, the ratio of Bitcoin transaction fees to the block subsidy has been about 2-3% average since 2020. This is very bad because the total value of Bitcoin has been increasing even while the amount of protection has been decreasing. This is basically protecting something more valuable with less security.\n\n**Bitcoin needs to reverse this trend or face the reality that its security model is not sustainable in the long run.**", "published": "2025-04-19T07:53:00"}
{"source": "news", "id": "https://dailyhodl.com/2025/04/19/trader-michael-van-de-poppe-says-bitcoin-to-rally-to-new-all-time-high-once-theres-clarity-on-these-two-matters/", "title": "Trader Michaël van de Poppe Says Bitcoin To Rally to New All-Time High Once There’s Clarity on These Two Matters", "published": "2025-04-19", "text": "A widely followed crypto analyst believes that Bitcoin (BTC) will print new all-time highs once there’s more clarity around two key issues.\n\nIn a new thread, crypto trader Michaël van de Poppe tells his 783,300 followers on the social media platform X that Bitcoin will likely break out once US President Donald Trump’s tariff policies and the Fed’s rate cut plans are clearer.\n\n“Bitcoin is still stuck in a range, which it has been acting in for basically two months. The longer something stays within a narrow range, the heavier the impulse will be once it breaks out of it. I assume that we’ll see light at the end of the tunnel with the FED/tariffs and that Bitcoin will fast rally towards new all-time highs in this quarter.”\n\nThe analyst also predicts that Bitcoin will outperform gold over the next year.\n\n“Quite frankly, if you’d ask me to choose between BTC or gold for the next 12 months, I’d almost always take Bitcoin as I assume that will be, percent-wise, substantially higher than gold. If you put it wider, if I had another $1,000 available, I’d rather want to put it in ETH.”\n\nThe analyst says that Bitcoin’s bull run will likely catch many off guard as worries about a recession mount.\n\n“It’s the final shakeout where a big majority believes we’re in a recession and early-peak top for Bitcoin. And then the big run comes.”\n\nBitcoin is trading for $84,576 at time of writing, flat on the day.\n\nFollow us on X Facebook and Telegram\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney", "status": "success"}
{"source": "news", "id": "https://coinfomania.com/pantera-ceo-counters-michael-saylors-13-million-bitcoin-prediction-with-realistic-745k-target/", "title": "Pantera CEO Counters Michael Saylor’s $13 Million Bitcoin Prediction With “Realistic” $745K Target", "published": "2025-04-19", "text": "The debate about the Bitcoin price’s future is heating up in the cryptocurrency market. Adding their own two cents to the debate, two of the crypto industry’s most prominent figures have offered contrasting predictions. MicroStrategy co-founder Michael Saylor has assumed a bullish stance. He has predicted that Bitcoin could soar to a whopping $13 million per piece in the next twenty years. On the other hand, Pantera Capital CEO Dan Morehead has provided a more tempered forecast, claiming that the Bitcoin price could reach a “realistic” $745,000 by 2028.\n\nSaylor’s $13 Million Bitcoin Prediction: The Ultimate Store of Value\n\nMichael Saylor, known to be the biggest Bitcoin maximalist, recently reiterated his prediction. At the Digital Asset Summit, he claimed that Bitcoin’s fixed supply of 21 million coins makes it a scarce commodity, unlike gold and oil. He believes gold and oil can be produced if demand surges. “I can stand here and say, I think Bitcoin’s gonna be $13 million in 20 years,” Saylor declared.\n\nPantera CEO Morehead Counters with $745K, Citing Institutional Adoption\n\nDan Morehead offers a more grounded perspective, though still bullish. In a November 2024 CNBC interview, he predicted Bitcoin could reach $745,000 by 2028, calling the cryptocurrency “officially at escape velocity.” Morehead dismissed his previous cautious stance that Bitcoin could go to zero, stating, “I don’t think it’s possible. Now, 50 million people in the US own and 300 million people globally, BlackRock and Fidelity are selling it like it.”\n\nPantera Capital CEO predicts #Bitcoin could reach $745,000, citing mass adoption, institutional support, and a potential $15T market cap. pic.twitter.com/4Iv8rLnwpN — Roundtable Network (@RTB_io) April 18, 2025\n\nMorehead highlighted the growing institutional embrace of Bitcoin, with major asset managers offering it to clients, and pointed out that a $745,000 price would push Bitcoin’s market cap to about $15 trillion, a fraction of the roughly $500 trillion in global financial assets. “That still seems small,” he said, referencing Saylor’s even loftier target.\n\nWhile Saylor’s $13 million price tag captures imaginations, Morehead’s forecast reflects a more measured optimism grounded in current adoption trends and market realities. Both agree, however, that Bitcoin’s future is bright and that betting on it going to zero is no longer a sensible position. With these bullish predictions coming in, let’s take a look at the latest price action to form a short-term Bitcoin prediction.\n\nBitcoin Price Analysis\n\nBitcoin commenced trading at a price of $84,880 yesterday. In the initial hours, Bitcoin faced a downtrend, but then ascended rapidly to test the $85,100 resistance. However, it could not sustain the bullish trend, and a slow decline followed. This downturn led Bitcoin to establish a new support at $84,450. With the $84,750 resistance in place, Bitcoin went on to display range-bound behavior until 12:00 UTC. But Bitcoin failed to form any meaningful uptrend from that point. At 13:00 UTC, a death cross formed on the MACD, leading Bitcoin to abandon the support level.\n\nChart 1: published on TradingView, April 19, 2025\n\nIt eventually settled at a new support level of $84,350. Bitcoin continued to work in a trading range, with the $84,750 resistance still in place. However, Bitcoin’s upward movements found resistance at the $84,650 mark, as it continues to consolidate in that narrow range. At 00:30 on April 19, a golden cross formed on the MACD, and Bitcoin started scaling the charts. The resistance was broken at 3:00 UTC as Bitcoin continued to ascend to $85,250. With the market now overbought, Bitcoin faced a correction.\n\nBitcoin Price Prediction: Can Bitcoin Hold on Above $85K?\n\nBitcoin currently trades at $85,100. However, based on past performances, Bitcoin may relinquish its current support of $84,900 and look to stabilize under $ 85 K. With the coin in overbought conditions right now, a correction is bound to arrive. If Bitcoin can resist a dramatic fall, we may be in for a shot at $ 86 K. As of now, $745K sounds like a far cry, but given the worldwide interest Bitcoin has garnered, Morehead’s Bitcoin prediction is not too far-fetched either.", "status": "success"}
{"source": "news", "id": "https://coinpedia.org/news/bitcoin-price-prediction-2025/", "title": "Bitcoin Price Prediction 2025", "published": "2025-04-19", "text": "Fun-loving and cheerful, a passionate blockchain and crypto writer who knows no boundary…connect if you share the same passion. With 10+ years of writing experience, I am a Crypto Journalist by chance, exploring, and learning all the dynamics of the sci-fi action-filled crypto world. Currently, focusing on cryptocurrency news and price data. With a passion for research and challenging my capabilities, I am slowly getting into the crypto arena to bring new insights every day.\n\nStory Highlights Bitcoin is holding strong above $84,500, fueled by positive economic news and investor interest.\n\nAnalyst Benjamin Cowen predicts a major Bitcoin rally later this cycle, potentially reaching $120,000-$150,000.\n\nMaintaining support above $72,000 is crucial for Bitcoin's bullish trend to continue.\n\nBitcoin is holding strong above $84,500, showing resilience as market sentiment shifts. Strong U.S. job data and growing expectations of interest rate cuts are pushing investors to move away from traditional stocks and toward Bitcoin. Even as big tech stocks struggle, Bitcoin continues to show strength.\n\nCan BTC Break $84.9K? Bulls Target $87K Next\n\nBitcoin’s short-term outlook looks promising. If the price manages to break above $84,900, analysts say the next key target could be $87,000. So far, buyers are in control, and as long as that holds, the uptrend is expected to continue.\n\nBenjamin Cowen’s Bullish Outlook for Bitcoin\n\nPopular crypto analyst Benjamin Cowen believes that Bitcoin’s biggest move this cycle may still be in the cards. In a bullish scenario, he sees the price potentially hitting $200,000. More realistically, he expects a cycle top between $120,000 and $150,000 — but likely later in the cycle.\n\nAlso Read :\n\nAltcoin Season Coming Soon as BTC Dominance Rejected at Key Level\n\n,\n\n$72K Is Key Support — Can It Hold?\n\nOne of the most important levels to watch is Bitcoin’s 2024 high near $72,000. According to Cowen, holding this level on the weekly chart is essential to keep the bullish trend intact. While BTC hasn’t retested this zone yet, if it does, strong buying interest is expected to step in.\n\nCalm Market, But Bulls Still in the Lead\n\nAt the moment, Bitcoin is trading around $84,483, with little movement in the past 24 hours. Cowen remains cautiously optimistic. He notes that if a pullback happens, it will serve as a key test for the market’s strength. If BTC continues to hold above major levels, it could set the stage for a stronger rally later this year.\n\nCowen’s outlook remains bullish in the long term, with a possible move into six-figure territory. But for that to happen, Bitcoin needs to keep its momentum. For now, the bulls are holding steady — but the real test may still be ahead.\n\nWith key levels holding firm and sentiment shifting, Bitcoin’s next move could set the tone for the rest of the cycle.\n\nNever Miss a Beat in the Crypto World! Stay ahead with breaking news, expert analysis, and real-time updates on the latest trends in Bitcoin, altcoins, DeFi, NFTs, and more.\n\nFAQs", "status": "success"}
{"source": "news", "id": "https://u.today/no-way-xrp-is-worth-5800-vs-bitcoin-samson-mow", "title": "No Way XRP Is Worth $5,800 Vs Bitcoin: Samson Mow", "published": "2025-04-19", "text": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nBitcoiner Samson Mow published a tweet, suggesting that even if top altcoins had a total coin supply similar to that of Bitcoin, BTC would still beat them in terms of price per coin.\n\nMow stated that most altcoins are taking advantage of the so-called unit bias — a psychological effect that appears since, due to their huge supplies of billions and sometimes even trillions of coins, the price per coin seems cheaper than that of one BTC.\n\nIf this bias is removed, he says, then mathematically, these altcoins should be worth several thousand of dollars each. But Mow doesn’t believe in these theoretical figures, saying that Bitcoin would still have a much higher market dominance.\n\nAdvertisement\n\n\"No way XRP is worth $5,800\"\n\nMow suggested that if this bias is removed, XRP would cost $5,800, SOL would be trading at $3,400, and ETH at $9,200. He explained that these figures can be calculated “by taking the market cap of the alts and dividing by 21 million, thus framing their supply in terms of Bitcoin supply.”\n\nFor example, he shows, ETH: $193B market cap / 21M = $9,200. Most altcoins, Mow claims, take advantage of this unit bias “by utilizing a very high supply, so people can't figure out what they're buying.”\n\nMany believe that buying one XRP for $2, for example, is much cheaper than buying Bitcoin at $85,000, he says, adding that “unit bias is absolutely destroying the uninitiated.”\n\nThose numbers are calculated by taking the market cap of the alts and dividing by 21 million, thus framing their supply in terms of Bitcoin supply.\n\n\n\nETH: $193B market cap / 21M = $9,200\n\n\n\nInstead of buying that one twenty-one millionth of Etherium, you could buy just 0.11 BTC. — Samson Mow (@Excellion) April 19, 2025\n\nFinally, he said in reality there is “no way these alts are worth that much.”\n\nNew name for 1-21-millionth unit proposed by Mow\n\nContinuing the topic raised in the above-mentioned tweet, Mow suggested that perhaps one twenty-one millionth unit of any coin needs a name. He stressed that this is not common knowledge, but right now, 10 Sats are called one Finney (after Hal Finney, an early Bitcoin contributor).\n\nJust thinking that we need a better name for one twenty-one millionth.\n\n\n\nWe should use Finney for that. Right now it's uncommon, but a Finney defined as 10 sats - I bet you didn't even know that. No one needs a unit for 10 sats. But we do need an easy to way refer to 1/21… https://t.co/yTMGpXVIbi — Samson Mow (@Excellion) April 19, 2025\n\nBut hardly anybody needs a unit for 10 Sats. Therefore, Mow suggests using this name to define one twenty-one millionth supply unit not only of Bitcoin but of each large altcoin and gold as well. Therefore, he says, “A Finney of Bitcoin = $85,000 (for now). A Finney of ETH = $9,200. A Finney of gold = $1,000,000.” Samson Mow asked the community to share what they think about this idea.", "status": "success"}
{"source": "reddit", "id": "1k2sis7", "title": "Bank of International Settlements report: Cryptocurrencies and decentralised finance: functions and financial stability implications", "text": "Here's the BIS summary blurb:\n\n&gt; Cryptocurrencies and decentralised finance (DeFi) aim to replicate many of the economic functions of traditional finance (TradFi), but their distinctive features introduce new financial stability risks. We analyse these features, and examine key developments, such as smart contracts, decentralised exchanges (DEXs), stablecoins and new forms of central bank money. \n&gt; Our findings suggest that while the underlying economic drivers are not different than in TradFi, DeFi poses significant challenges, including new forms of information asymmetries, market inefficiencies and the risk of cryptoisation in emerging markets. \n&gt; We propose tailored regulatory interventions, such as embedding rules within smart contracts and strengthening the oversight of stablecoins, to manage financial stability risks. Finally, we provide a framework for prudential regulation that can mitigate risks while fostering innovation in the rapidly evolving crypto ecosystem.", "published": "2025-04-19T09:34:37"}
{"source": "reddit", "id": "1k2r5jf", "title": "Bitcoin's security via block rewards has declined more than 50% over the past 4 years [OC]", "text": "Up until recently, Bitcoin's security budget provided by the block rewards has never decreased across a 4-year cycle.\n\nThere's a very clear trend that rate at which block rewards increases from cycle to cycle is greatly decreasing over time.\n\n[Log scale. Anything below 1.0 represents a decline in security over 4 years.](https://preview.redd.it/gyz6g93kyqve1.png?width=857&amp;format=png&amp;auto=webp&amp;s=8943bc3d4dde8d3f79e7b987402639b7ea30cc0d)\n\n* From 2011 to 2015, block rewards increased by \\~500x\n* From 2015 to 2019, block rewards increased by \\~5x\n* From 2019 to 2023, block rewards increased by \\~2x\n* In the most recent year from 2021 to 2025, block rewards increased by \\~0x\n\n2022 was the first time that the block reward decreased in 4 years. And March 2025 was the first time that block rewards decreased by so much that it lost over 50% of its security via block rewards (vs 4 years prior).\n\nEarly Bitcoin devs have always warned that Bitcoin's security is not sustainable unless transaction fees replace the gradually-disappearing block subsidy (or unless Bitcoin adopts a different security model).\n\nHowever, the ratio of Bitcoin transaction fees to the block subsidy has been about 2-3% average since 2020. This is very bad because the total value of Bitcoin has been increasing even while the amount of protection has been decreasing. This is basically protecting something more valuable with less security.\n\n**Bitcoin needs to reverse this trend or face the reality that its security model is not sustainable in the long run.**", "published": "2025-04-19T07:53:00"}
{"source": "news", "id": "https://dailyhodl.com/2025/04/19/trader-michael-van-de-poppe-says-bitcoin-to-rally-to-new-all-time-high-once-theres-clarity-on-these-two-matters/", "title": "Trader Michaël van de Poppe Says Bitcoin To Rally to New All-Time High Once There’s Clarity on These Two Matters", "published": "2025-04-19", "text": "A widely followed crypto analyst believes that Bitcoin (BTC) will print new all-time highs once there’s more clarity around two key issues.\n\nIn a new thread, crypto trader Michaël van de Poppe tells his 783,300 followers on the social media platform X that Bitcoin will likely break out once US President Donald Trump’s tariff policies and the Fed’s rate cut plans are clearer.\n\n“Bitcoin is still stuck in a range, which it has been acting in for basically two months. The longer something stays within a narrow range, the heavier the impulse will be once it breaks out of it. I assume that we’ll see light at the end of the tunnel with the FED/tariffs and that Bitcoin will fast rally towards new all-time highs in this quarter.”\n\nThe analyst also predicts that Bitcoin will outperform gold over the next year.\n\n“Quite frankly, if you’d ask me to choose between BTC or gold for the next 12 months, I’d almost always take Bitcoin as I assume that will be, percent-wise, substantially higher than gold. If you put it wider, if I had another $1,000 available, I’d rather want to put it in ETH.”\n\nThe analyst says that Bitcoin’s bull run will likely catch many off guard as worries about a recession mount.\n\n“It’s the final shakeout where a big majority believes we’re in a recession and early-peak top for Bitcoin. And then the big run comes.”\n\nBitcoin is trading for $84,576 at time of writing, flat on the day.\n\nFollow us on X Facebook and Telegram\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney", "status": "success"}
{"source": "news", "id": "https://coinfomania.com/pantera-ceo-counters-michael-saylors-13-million-bitcoin-prediction-with-realistic-745k-target/", "title": "Pantera CEO Counters Michael Saylor’s $13 Million Bitcoin Prediction With “Realistic” $745K Target", "published": "2025-04-19", "text": "The debate about the Bitcoin price’s future is heating up in the cryptocurrency market. Adding their own two cents to the debate, two of the crypto industry’s most prominent figures have offered contrasting predictions. MicroStrategy co-founder Michael Saylor has assumed a bullish stance. He has predicted that Bitcoin could soar to a whopping $13 million per piece in the next twenty years. On the other hand, Pantera Capital CEO Dan Morehead has provided a more tempered forecast, claiming that the Bitcoin price could reach a “realistic” $745,000 by 2028.\n\nSaylor’s $13 Million Bitcoin Prediction: The Ultimate Store of Value\n\nMichael Saylor, known to be the biggest Bitcoin maximalist, recently reiterated his prediction. At the Digital Asset Summit, he claimed that Bitcoin’s fixed supply of 21 million coins makes it a scarce commodity, unlike gold and oil. He believes gold and oil can be produced if demand surges. “I can stand here and say, I think Bitcoin’s gonna be $13 million in 20 years,” Saylor declared.\n\nPantera CEO Morehead Counters with $745K, Citing Institutional Adoption\n\nDan Morehead offers a more grounded perspective, though still bullish. In a November 2024 CNBC interview, he predicted Bitcoin could reach $745,000 by 2028, calling the cryptocurrency “officially at escape velocity.” Morehead dismissed his previous cautious stance that Bitcoin could go to zero, stating, “I don’t think it’s possible. Now, 50 million people in the US own and 300 million people globally, BlackRock and Fidelity are selling it like it.”\n\nPantera Capital CEO predicts #Bitcoin could reach $745,000, citing mass adoption, institutional support, and a potential $15T market cap. pic.twitter.com/4Iv8rLnwpN — Roundtable Network (@RTB_io) April 18, 2025\n\nMorehead highlighted the growing institutional embrace of Bitcoin, with major asset managers offering it to clients, and pointed out that a $745,000 price would push Bitcoin’s market cap to about $15 trillion, a fraction of the roughly $500 trillion in global financial assets. “That still seems small,” he said, referencing Saylor’s even loftier target.\n\nWhile Saylor’s $13 million price tag captures imaginations, Morehead’s forecast reflects a more measured optimism grounded in current adoption trends and market realities. Both agree, however, that Bitcoin’s future is bright and that betting on it going to zero is no longer a sensible position. With these bullish predictions coming in, let’s take a look at the latest price action to form a short-term Bitcoin prediction.\n\nBitcoin Price Analysis\n\nBitcoin commenced trading at a price of $84,880 yesterday. In the initial hours, Bitcoin faced a downtrend, but then ascended rapidly to test the $85,100 resistance. However, it could not sustain the bullish trend, and a slow decline followed. This downturn led Bitcoin to establish a new support at $84,450. With the $84,750 resistance in place, Bitcoin went on to display range-bound behavior until 12:00 UTC. But Bitcoin failed to form any meaningful uptrend from that point. At 13:00 UTC, a death cross formed on the MACD, leading Bitcoin to abandon the support level.\n\nChart 1: published on TradingView, April 19, 2025\n\nIt eventually settled at a new support level of $84,350. Bitcoin continued to work in a trading range, with the $84,750 resistance still in place. However, Bitcoin’s upward movements found resistance at the $84,650 mark, as it continues to consolidate in that narrow range. At 00:30 on April 19, a golden cross formed on the MACD, and Bitcoin started scaling the charts. The resistance was broken at 3:00 UTC as Bitcoin continued to ascend to $85,250. With the market now overbought, Bitcoin faced a correction.\n\nBitcoin Price Prediction: Can Bitcoin Hold on Above $85K?\n\nBitcoin currently trades at $85,100. However, based on past performances, Bitcoin may relinquish its current support of $84,900 and look to stabilize under $ 85 K. With the coin in overbought conditions right now, a correction is bound to arrive. If Bitcoin can resist a dramatic fall, we may be in for a shot at $ 86 K. As of now, $745K sounds like a far cry, but given the worldwide interest Bitcoin has garnered, Morehead’s Bitcoin prediction is not too far-fetched either.", "status": "success"}
{"source": "news", "id": "https://coinpedia.org/news/bitcoin-price-prediction-2025/", "title": "Bitcoin Price Prediction 2025", "published": "2025-04-19", "text": "Fun-loving and cheerful, a passionate blockchain and crypto writer who knows no boundary…connect if you share the same passion. With 10+ years of writing experience, I am a Crypto Journalist by chance, exploring, and learning all the dynamics of the sci-fi action-filled crypto world. Currently, focusing on cryptocurrency news and price data. With a passion for research and challenging my capabilities, I am slowly getting into the crypto arena to bring new insights every day.\n\nStory Highlights Bitcoin is holding strong above $84,500, fueled by positive economic news and investor interest.\n\nAnalyst Benjamin Cowen predicts a major Bitcoin rally later this cycle, potentially reaching $120,000-$150,000.\n\nMaintaining support above $72,000 is crucial for Bitcoin's bullish trend to continue.\n\nBitcoin is holding strong above $84,500, showing resilience as market sentiment shifts. Strong U.S. job data and growing expectations of interest rate cuts are pushing investors to move away from traditional stocks and toward Bitcoin. Even as big tech stocks struggle, Bitcoin continues to show strength.\n\nCan BTC Break $84.9K? Bulls Target $87K Next\n\nBitcoin’s short-term outlook looks promising. If the price manages to break above $84,900, analysts say the next key target could be $87,000. So far, buyers are in control, and as long as that holds, the uptrend is expected to continue.\n\nBenjamin Cowen’s Bullish Outlook for Bitcoin\n\nPopular crypto analyst Benjamin Cowen believes that Bitcoin’s biggest move this cycle may still be in the cards. In a bullish scenario, he sees the price potentially hitting $200,000. More realistically, he expects a cycle top between $120,000 and $150,000 — but likely later in the cycle.\n\nAlso Read :\n\nAltcoin Season Coming Soon as BTC Dominance Rejected at Key Level\n\n,\n\n$72K Is Key Support — Can It Hold?\n\nOne of the most important levels to watch is Bitcoin’s 2024 high near $72,000. According to Cowen, holding this level on the weekly chart is essential to keep the bullish trend intact. While BTC hasn’t retested this zone yet, if it does, strong buying interest is expected to step in.\n\nCalm Market, But Bulls Still in the Lead\n\nAt the moment, Bitcoin is trading around $84,483, with little movement in the past 24 hours. Cowen remains cautiously optimistic. He notes that if a pullback happens, it will serve as a key test for the market’s strength. If BTC continues to hold above major levels, it could set the stage for a stronger rally later this year.\n\nCowen’s outlook remains bullish in the long term, with a possible move into six-figure territory. But for that to happen, Bitcoin needs to keep its momentum. For now, the bulls are holding steady — but the real test may still be ahead.\n\nWith key levels holding firm and sentiment shifting, Bitcoin’s next move could set the tone for the rest of the cycle.\n\nNever Miss a Beat in the Crypto World! Stay ahead with breaking news, expert analysis, and real-time updates on the latest trends in Bitcoin, altcoins, DeFi, NFTs, and more.\n\nFAQs", "status": "success"}
{"source": "news", "id": "https://u.today/no-way-xrp-is-worth-5800-vs-bitcoin-samson-mow", "title": "No Way XRP Is Worth $5,800 Vs Bitcoin: Samson Mow", "published": "2025-04-19", "text": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nBitcoiner Samson Mow published a tweet, suggesting that even if top altcoins had a total coin supply similar to that of Bitcoin, BTC would still beat them in terms of price per coin.\n\nMow stated that most altcoins are taking advantage of the so-called unit bias — a psychological effect that appears since, due to their huge supplies of billions and sometimes even trillions of coins, the price per coin seems cheaper than that of one BTC.\n\nIf this bias is removed, he says, then mathematically, these altcoins should be worth several thousand of dollars each. But Mow doesn’t believe in these theoretical figures, saying that Bitcoin would still have a much higher market dominance.\n\nAdvertisement\n\n\"No way XRP is worth $5,800\"\n\nMow suggested that if this bias is removed, XRP would cost $5,800, SOL would be trading at $3,400, and ETH at $9,200. He explained that these figures can be calculated “by taking the market cap of the alts and dividing by 21 million, thus framing their supply in terms of Bitcoin supply.”\n\nFor example, he shows, ETH: $193B market cap / 21M = $9,200. Most altcoins, Mow claims, take advantage of this unit bias “by utilizing a very high supply, so people can't figure out what they're buying.”\n\nMany believe that buying one XRP for $2, for example, is much cheaper than buying Bitcoin at $85,000, he says, adding that “unit bias is absolutely destroying the uninitiated.”\n\nThose numbers are calculated by taking the market cap of the alts and dividing by 21 million, thus framing their supply in terms of Bitcoin supply.\n\n\n\nETH: $193B market cap / 21M = $9,200\n\n\n\nInstead of buying that one twenty-one millionth of Etherium, you could buy just 0.11 BTC. — Samson Mow (@Excellion) April 19, 2025\n\nFinally, he said in reality there is “no way these alts are worth that much.”\n\nNew name for 1-21-millionth unit proposed by Mow\n\nContinuing the topic raised in the above-mentioned tweet, Mow suggested that perhaps one twenty-one millionth unit of any coin needs a name. He stressed that this is not common knowledge, but right now, 10 Sats are called one Finney (after Hal Finney, an early Bitcoin contributor).\n\nJust thinking that we need a better name for one twenty-one millionth.\n\n\n\nWe should use Finney for that. Right now it's uncommon, but a Finney defined as 10 sats - I bet you didn't even know that. No one needs a unit for 10 sats. But we do need an easy to way refer to 1/21… https://t.co/yTMGpXVIbi — Samson Mow (@Excellion) April 19, 2025\n\nBut hardly anybody needs a unit for 10 Sats. Therefore, Mow suggests using this name to define one twenty-one millionth supply unit not only of Bitcoin but of each large altcoin and gold as well. Therefore, he says, “A Finney of Bitcoin = $85,000 (for now). A Finney of ETH = $9,200. A Finney of gold = $1,000,000.” Samson Mow asked the community to share what they think about this idea.", "status": "success"}
{"source": "reddit", "id": "1k2sis7", "title": "Bank of International Settlements report: Cryptocurrencies and decentralised finance: functions and financial stability implications", "text": "Here's the BIS summary blurb:\n\n&gt; Cryptocurrencies and decentralised finance (DeFi) aim to replicate many of the economic functions of traditional finance (TradFi), but their distinctive features introduce new financial stability risks. We analyse these features, and examine key developments, such as smart contracts, decentralised exchanges (DEXs), stablecoins and new forms of central bank money. \n&gt; Our findings suggest that while the underlying economic drivers are not different than in TradFi, DeFi poses significant challenges, including new forms of information asymmetries, market inefficiencies and the risk of cryptoisation in emerging markets. \n&gt; We propose tailored regulatory interventions, such as embedding rules within smart contracts and strengthening the oversight of stablecoins, to manage financial stability risks. Finally, we provide a framework for prudential regulation that can mitigate risks while fostering innovation in the rapidly evolving crypto ecosystem.", "published": "2025-04-19T09:34:37"}
{"source": "reddit", "id": "1k2r5jf", "title": "Bitcoin's security via block rewards has declined more than 50% over the past 4 years [OC]", "text": "Up until recently, Bitcoin's security budget provided by the block rewards has never decreased across a 4-year cycle.\n\nThere's a very clear trend that rate at which block rewards increases from cycle to cycle is greatly decreasing over time.\n\n[Log scale. Anything below 1.0 represents a decline in security over 4 years.](https://preview.redd.it/gyz6g93kyqve1.png?width=857&amp;format=png&amp;auto=webp&amp;s=8943bc3d4dde8d3f79e7b987402639b7ea30cc0d)\n\n* From 2011 to 2015, block rewards increased by \\~500x\n* From 2015 to 2019, block rewards increased by \\~5x\n* From 2019 to 2023, block rewards increased by \\~2x\n* In the most recent year from 2021 to 2025, block rewards increased by \\~0x\n\n2022 was the first time that the block reward decreased in 4 years. And March 2025 was the first time that block rewards decreased by so much that it lost over 50% of its security via block rewards (vs 4 years prior).\n\nEarly Bitcoin devs have always warned that Bitcoin's security is not sustainable unless transaction fees replace the gradually-disappearing block subsidy (or unless Bitcoin adopts a different security model).\n\nHowever, the ratio of Bitcoin transaction fees to the block subsidy has been about 2-3% average since 2020. This is very bad because the total value of Bitcoin has been increasing even while the amount of protection has been decreasing. This is basically protecting something more valuable with less security.\n\n**Bitcoin needs to reverse this trend or face the reality that its security model is not sustainable in the long run.**", "published": "2025-04-19T07:53:00"}
{"source": "reddit", "source_id": "r/CryptoCurrency", "id": "1k2sis7", "title": "Bank of International Settlements report: Cryptocurrencies and decentralised finance: functions and financial stability implications", "text": "Here's the BIS summary blurb:\n\n&gt; Cryptocurrencies and decentralised finance (DeFi) aim to replicate many of the economic functions of traditional finance (TradFi), but their distinctive features introduce new financial stability risks. We analyse these features, and examine key developments, such as smart contracts, decentralised exchanges (DEXs), stablecoins and new forms of central bank money. \n&gt; Our findings suggest that while the underlying economic drivers are not different than in TradFi, DeFi poses significant challenges, including new forms of information asymmetries, market inefficiencies and the risk of cryptoisation in emerging markets. \n&gt; We propose tailored regulatory interventions, such as embedding rules within smart contracts and strengthening the oversight of stablecoins, to manage financial stability risks. Finally, we provide a framework for prudential regulation that can mitigate risks while fostering innovation in the rapidly evolving crypto ecosystem.", "published": "2025-04-19T09:34:37"}
{"source": "reddit", "source_id": "r/CryptoCurrency", "id": "1k2r5jf", "title": "Bitcoin's security via block rewards has declined more than 50% over the past 4 years [OC]", "text": "Up until recently, Bitcoin's security budget provided by the block rewards has never decreased across a 4-year cycle.\n\nThere's a very clear trend that rate at which block rewards increases from cycle to cycle is greatly decreasing over time.\n\n[Log scale. Anything below 1.0 represents a decline in security over 4 years.](https://preview.redd.it/gyz6g93kyqve1.png?width=857&amp;format=png&amp;auto=webp&amp;s=8943bc3d4dde8d3f79e7b987402639b7ea30cc0d)\n\n* From 2011 to 2015, block rewards increased by \\~500x\n* From 2015 to 2019, block rewards increased by \\~5x\n* From 2019 to 2023, block rewards increased by \\~2x\n* In the most recent year from 2021 to 2025, block rewards increased by \\~0x\n\n2022 was the first time that the block reward decreased in 4 years. And March 2025 was the first time that block rewards decreased by so much that it lost over 50% of its security via block rewards (vs 4 years prior).\n\nEarly Bitcoin devs have always warned that Bitcoin's security is not sustainable unless transaction fees replace the gradually-disappearing block subsidy (or unless Bitcoin adopts a different security model).\n\nHowever, the ratio of Bitcoin transaction fees to the block subsidy has been about 2-3% average since 2020. This is very bad because the total value of Bitcoin has been increasing even while the amount of protection has been decreasing. This is basically protecting something more valuable with less security.\n\n**Bitcoin needs to reverse this trend or face the reality that its security model is not sustainable in the long run.**", "published": "2025-04-19T07:53:00"}
